using UnityEngine;

public class _2IfStatementTask : MonoBehaviour
{
    //Перед выполнение задания повесте данный скрипт на обьект Target на сцене
    //и убедитесь что на нем нет других скриптов
    //По завершению задания в коде не должно быть ни одной ошибки компиляции, которая не позволяет
    //скомпилировать код. Такой код по умолчанию является неверным
    public int conditionNumber1 = 5;
    public int conditionNumber2 = 12;
    public int conditionNumber3 = -3;
    
    //Задание 1. Напишите код, который выведет сообщение в консоль(Любое), при условии что переменная
    //conditionNumber1 равна 5(Значение переменной можете менять в инспекторе юнити)
    //Задание 2. Напишите еще одно условие, которое бы выводило сообщение в консоль если переменная
    //conditionNumber2 меньше 20
    //Задание 3. Напишите еще одно условие, которое бы выводило сообщение в консоль если переменная
    //conditionNumber3 больше или равна 0
    //Задание 4. Напшите условие, которое выводило бы сообщение в консоль если переменная conditionNumber1
    //больше 5 и меньше 12
    //Задание 5. Напишите условие, которое выводило бы сообщение в консоль если переменная conditionNumber2
    //меньше 20 или больше 0
    //Задание 6. Напишите условие, которое выводило бы сообщение в консоль если переменаая conditionNumber3
    //меньше переменной conditionNumber2
    //Задание 7. Напишите условие, которое выводило бы сообщение в консоль если переменаая conditionNumber1
    //и переменная conditionNumber2 больше 0
    //Задание 8. Напишите условие, которое выводило бы сообщение в консоль если переменаая conditionNumber1
    //или переменная conditionNumber3 меньше 20
    //Задание 9. Напишите условие, которое выводило бы сообщение в консоль если переменаая conditionNumber1
    //или переменная conditionNumber3 меньше переменной conditionNumber2
    void Start()
    {
        
    }
}
