using UnityEngine;

public class _3NumberChangeTask : MonoBehaviour
{
    //Перед выполнение задания повесте данный скрипт на обьект Target на сцене
    //и убедитесь что на нем нет других скриптов
    //По завершению задания в коде не должно быть ни одной ошибки компиляции, которая не позволяет
    //скомпилировать код. Такой код по умолчанию является неверным
    //ссылка на информацию https://metanit.com/sharp/tutorial/2.3.php
    private int number1;
    public int number2;
    //Все задания выполняются в методе старт
    //Задание 1. Напишите код, который бы задал переменной number1 значение 5
    //Задание 2. Напишите код, который бы увеличил текущее значение переменной number1 на 2;
    //Задание 3. Напишите код, который бы уменьшил текущее значение переменной number1 на 4;
    //Задание 4. Напишите код, который бы умножил текущее значение переменной number1 на 2;
    //Задание 5. Напишите код, который бы разделил текущее значение переменной number1 на 2;
    //Задание 6. Напишите код, который бы задал значение переменной number2(например 5) а затем добавил в
    //переменную number1 число, которое хранится в переменной number2
    
    void Start()
    {
        
    }
}
