using UnityEngine;

public class _5ForLoopTask : MonoBehaviour
{
    //Перед выполнение задания повесте данный скрипт на обьект Target на сцене
    //и убедитесь что на нем нет других скриптов
    //По завершению задания в коде не должно быть ни одной ошибки компиляции, которая не позволяет
    //скомпилировать код. Такой код по умолчанию является неверным
    
    public int maxNumber = 10;
    public int[] numbers = new int[15];

    //Задание 1. С помощью цикла for выведи в консоль числа от 0 до 10 включительно
    //Задание 2. С помощью цикла for выведи в консоль числа от 1 до maxNumber включительно
    //Задание 3. С помощью цикла for выведи в консоль только чётные числа от 0 до 20 включительно
    //Задание 4. С помощью цикла for выведи в консоль числа от 20 до 0 (в обратном порядке)
    //Задание 5. С помощью цикла for посчитай сумму всех чисел от 1 до 15 и выведи её в консоль одной строкой
    //Задание 6. Заполни массив numbers значениями от 100 до 114 (то есть numbers[0] = 100, numbers[1] = 101 … numbers[14] = 114)
    //Задание 7. С помощью цикла for выведи в консоль только те элементы массива numbers, которые больше 105
    //Задание 8. С помощью цикла for посчитай и выведи в консоль сколько в массиве numbers элементов, которые делятся на 3 без остатка

    void Start()
    {
        
    }
}