using UnityEngine;

public class _8TransformBasicTask : MonoBehaviour
{
    //Перед выполнение задания повесте данный скрипт на обьект Target на сцене
    //и убедитесь что на нем нет других скриптов
    //По завершению задания в коде не должно быть ни одной ошибки компиляции, которая не позволяет
    //скомпилировать код. Такой код по умолчанию является неверным

    //Задание 1. Выведи в консоль текущий transform этого объекта

    //Задание 2. Выведи в консоль текущую позицию объекта (координаты X, Y, Z)

    //Задание 3. Выведи в консоль текущее вращение объекта в градусах (eulerAngles)

    //Задание 4. Выведи в консоль текущий масштаб объекта

    //Задание 5. Подними объект ровно на 3 единицы вверх по оси Y

    //Задание 6. Поверни объект на 45 градусов вокруг оси Y (используй только transform.Rotate)

    //Задание 7. Увеличь масштаб объекта в 1.5 раза по всем трём осям

    //Задание 8. Сбрось позицию в (0, 0, 0), вращение в (0, 0, 0) и масштаб в (1, 1, 1)

    void Start()
    {
        
    }
}