using UnityEngine;

public class ArrayTask : MonoBehaviour
{
    //Перед выполнение задания повесте данный скрипт на обьект Target на сцене
    //и убедитесь что на нем нет других скриптов
    //По завершению задания в коде не должно быть ни одной ошибки компиляции, которая не позволяет
    //скомпилировать код. Такой код по умолчанию является неверным
    public int[] array;
    //Задание 1. Заполнить в инспеторе массив array разными значениями, пока в нем не будет 10 элементов
    //Задание 2. Выведите сообщение в консоль, в котором бы показывался бы 5 элемент списка
    //Задание 3. Напишите код, который бы заменил значение 6 элемента списка на значение 5
    //Задание 4. Напишите код, который бы вывел сообщение в консоль, если 2 элемент списка больше 0
    void Start()
    {
        
    }
}
